/*
  - react Query:  أنها مكتبة جلب البيانات لتطبيقات الويب

  ---- QueryClientProvider: 
  ---- دي كمبونانت لازم نستخدمها ونحط جواها التطبيق بتاعنا عشان نضيف للتطبيقنا خادم لجلب البيانات
  ---- بتقبل جواها بروبس اسمها كلاينت ودي عشان نضيف فيها الكلاينت او الخادم الي هننشائه

  ---- QueryClient: دي هي الفانكشن الي بكتبها عشان انشاء بيها الخادم بتاعي 
  =================================================
  ---- App.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
*/

/* 
  - useQuery({queryKey: ["name of key"] required, queryFn: function to fetch the data Required}) 
  ---- دي فانكشن جاهزه من المكتبه بتساعدك في جلب البيانت والتحكم بها في كل الحالات حاله التحميل والخطاء و جلب البيانات فعلا
  =================================================
  ---- SuperHeroes.jsx لمشاهده الامثله عليها والفهم اكتر اذهب لصفحه
  =================================================
*/