/*
  npm run server-json:
  الامر دا رنه في الترمنال عشان تشغل الباك اند باستخدام اداه سيرفير جسون وعشان ال اي بي اي تشتغل

  - TanStack: هو موقع عليه مجموعه من المكاتب المشهوره ومنها رياكت كويري

  - react Query: Apis أنها مكتبة جلب البيانات لتطبيقات الويب والتعامل مع حالات الاستعلام الخاصه بي ال 

  ---- QueryClientProvider: 
  ---- دي كمبونانت لازم نستخدمها ونحط جواها التطبيق بتاعنا عشان نضيف للتطبيقنا خادم لجلب البيانات
  ---- بتقبل جواها بروبس اسمها كلاينت ودي عشان نضيف فيها الكلاينت او الخادم الي هننشائه

  ---- QueryClient: دي هي الفانكشن الي بكتبها عشان انشاء بيها الخادم بتاعي 
  =================================================
  ---- App.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
*/

/* 
  - ReactQueryDevtools 
  ---- React Query ستحتاج إلى أدوات التطوير هذه بجانبك. إنها تساعد في تصور جميع الأعمال الداخلية لـ 
  ---- ومن المحتمل أن توفر عليك ساعات من تصحيح الأخطاء إذا وجدت نفسك في مأزق!
  ---- props:
  ------ initialIsOpen: [false default | true]  

  ------ buttonPosition بيعرض مكان الايكون بتاعت التولز 
  ------ ["top-left" | "top-right" | "bottom-left" | "bottom-right" default| "relative"]

  ------ position بتعبر عن المكان الي المفروض الصفحه الي فيها بيانات الارسال بتاعت الطلب هتكون فين
  ------ ["top" | "bottom" default| "left" | "right"]
  =================================================
  ---- App.jsx لمشاهده الامثله عليها والفهم اكتر اذهب لصفحه
  =================================================
*/


/* 
  - useQuery({queryKey: ["name of key"] required, queryFn: function to fetch the data Required, props}) 
  ---- دي فانكشن جاهزه من المكتبه بتساعدك في جلب البيانات والتحكم بها في كل الحالات 
  ---- isPending حاله التحميل باستخدامها في الوجهه الاماميه للمستخدم عشان يعرف ان في تحميل بيتم
  ---- isFetching حاله تحميل برده ولكن بتم في الخلفيه
  ---- الفرق بينهم ان البيانات بعد ما بتتحمل و بتظهر للمستخدم علي الشاشه بتتخزن في الخادم الافتراضي للموقع
  ---- لمده 5 دقائق في المستخدم لو قفل الصفحه ورجع ليها تاني قبل ما الخمس دقائق يخلصه البيانات تظهره ليه من الخادم
  ---- بدون تحميل ودا يحسن من اداء الموقع بتاعي ولكن برده بيتم عمل فيتش للبيانات في الخلفيه لو البيانات  اتجددت
  ---- بتظهر علطول للمستخدم بدل البيانات القديمه وكل دا مش بياخد ثواني
  ---- isSuccess حاله نجاح جلب البيانات
  ---- data متغير فيه البيانات العاده من ال ابي ايه
  ---- isError حاله الخطاء
  ---- error متغير فيه شرح للخطاء في رساله

  ---- props:
  ------ gcTime:
    ----- دي بتمثل مفهوم حفظ البيانات موقتا في مكان تخزين افتراضي والفايده منها انك لما بتجيب البيانات 
    ----- cache time بتعمل علامه تحميل لتحسين من جوده الموقع ومن ثمه بنجيب البيانات ونعرضها في الصفحه وبيتم تلقائي تخزنها في مكان اسمه
    ----- لمده افتراضيه وهي خمس دقائق ومن الممكن التعديل علي المده بتقليلها او زيادتها 
    ----- وطبعا في حاله الخروج من صفحه البيانات والرجوع اليها سوف تظهر بشكل سريع بدون جلب بيانات الي في حاله تحدثها 
    ----- وبعد انتهاء مده التخزين التلقائي يتم حذفها ونبدا في جلب البيانات من جديد

  ------ staleTime: بتقلل عدد الطلبات في السيرفر
    ----  وجدنا انه دائما عند الذهاب والرجوع الي نفس الصفحه يتم عمل ريكوست في السيرفر حته لو البيانات متجددتش 
    ---- في هذه الخاصيه تجعل البيانات التي تم جلبها للتو هي بيانات جديده وفي حاله الذهاب والرجوع لنفس الصفحه 
    ---- مش هيتم عمل ريكوست للسيرفر عشان يجيب البيانات لانه بيعتبر ان البيانات ديه هي اجدد حاجه في متعملش اي طلبات خالص لمده معينه من الزمن
    ---- الخصيه ديه بتقبل قيمه بتعبر عن الزمن بالملي ثانيه والقيمه الافتراضيه لها صفر

  ------ refetchOnMount: [true Default | false | always]
    ---- إذا تم التعيين على "صحيح"، فسيتم إعادة جلب الاستعلام عند التحميل 
    ---- إذا تم التعيين على "خطاء"، فسيتم إعادة جلب الاستعلام في حاله واحده ان الاستعلام يكون موجود لاول مره 
    ---- بمعني لو البيانات متخزنه في الكاش مش هيعمل ليها فيتش تاني لحد ما مدتها تخلص وتتحذف 

  ------ refetchOnWindowFocus: [true Default | false | always]
    ---- إذا تم التعيين على "صحيح"، فسيتم إعادة جلب الاستعلام بشكل مباشر لحظي مش بتحتاج تعمل ريفراش للصفحه يناسب تطبيقات البورصه والاخبار
    ---- إذا تم التعيين على "خطاء"، فسيتم إعادة جلب الاستعلام عند عمل ريفراش للصفحه او التنقل بين الصفحات

  ------ refetchInterval: [false Default | number | function]
    ---- يتم جلب البيانات تلقائيا بشكل دوري كل مده زمنيه معينه انا الي بحددها وبيكون الزمن بالمللي ثانيه
    ---- ملحوظه لو البيانات اتغيرت في الداتا بيز وانا عامل جلب البيانات بشكل دوري كل 10 ثواني مثلا البيانات
    ---- هتفضل قديم قدام المستخدم لحد ما العشر ثواني يخلصوا وبعدها هتجدد تلقائي قدام المستخدم
  

  
  =================================================
  ---- App.jsx (gcTime only) لمشاهده الامثله عليها والفهم اكتر اذهب لصفحه
  ---- SuperHeroes.jsx لمشاهده الامثله عليها والفهم اكتر اذهب لصفحه
  =================================================
  */
