/*
  npm run server-json:
  الامر دا رنه في الترمنال عشان تشغل الباك اند باستخدام اداه سيرفير جسون وعشان ال اي بي اي تشتغل

  - TanStack: هو موقع عليه مجموعه من المكاتب المشهوره ومنها رياكت كويري

  - react Query: Apis أنها مكتبة جلب البيانات لتطبيقات الويب والتعامل مع حالات الاستعلام الخاصه بي ال 

  ---- QueryClientProvider: 
  ---- دي كمبونانت لازم نستخدمها ونحط جواها التطبيق بتاعنا عشان نضيف للتطبيقنا خادم لجلب البيانات
  ---- بتقبل جواها بروبس اسمها كلاينت ودي عشان نضيف فيها الكلاينت او الخادم الي هننشائه

  ---- QueryClient: دي هي الفانكشن الي بكتبها عشان انشاء بيها الخادم بتاعي 
  =================================================
  ---- App.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
*/

/* 
  - ReactQueryDevtools 
  ---- React Query ستحتاج إلى أدوات التطوير هذه بجانبك. إنها تساعد في تصور جميع الأعمال الداخلية لـ 
  ---- ومن المحتمل أن توفر عليك ساعات من تصحيح الأخطاء إذا وجدت نفسك في مأزق!
  ---- props:
  ------ initialIsOpen: [false default | true]  

  ------ buttonPosition بيعرض مكان الايكون بتاعت التولز 
  ------ ["top-left" | "top-right" | "bottom-left" | "bottom-right" default| "relative"]

  ------ position بتعبر عن المكان الي المفروض الصفحه الي فيها بيانات الارسال بتاعت الطلب هتكون فين
  ------ ["top" | "bottom" default| "left" | "right"]
  =================================================
  ---- App.jsx لمشاهده الامثله عليها والفهم اكتر اذهب لصفحه
  =================================================
*/

/* 
  - useQuery({queryKey: ["name of key"] required, queryFn: function to fetch the data Required, props}) 
  ---- دي فانكشن جاهزه من المكتبه بتساعدك في جلب البيانات والتحكم بها في كل الحالات 
  ---- isPending حاله التحميل باستخدامها في الوجهه الاماميه للمستخدم عشان يعرف ان في تحميل بيتم
  ---- isFetching حاله تحميل برده ولكن بتم في الخلفيه
  ---- الفرق بينهم ان البيانات بعد ما بتتحمل و بتظهر للمستخدم علي الشاشه بتتخزن في الخادم الافتراضي للموقع
  ---- لمده 5 دقائق في المستخدم لو قفل الصفحه ورجع ليها تاني قبل ما الخمس دقائق يخلصه البيانات تظهره ليه من الخادم
  ---- بدون تحميل ودا يحسن من اداء الموقع بتاعي ولكن برده بيتم عمل فيتش للبيانات في الخلفيه لو البيانات  اتجددت
  ---- بتظهر علطول للمستخدم بدل البيانات القديمه وكل دا مش بياخد ثواني
  ---- isSuccess حاله نجاح جلب البيانات
  ---- data متغير فيه البيانات العاده من ال ابي ايه
  ---- isError حاله الخطاء
  ---- error متغير فيه شرح للخطاء في رساله
  ---- isRefetching تستخدم في حاله اعاده جلب البيانات فيها ترجع صح عند جلب البيانات للمره الثانيه لتشير لاعاده التحميل
  ---- refetch 
    ---- فانكشن جاهزه بترجع كانتيحه من النواتج بتاعت الهوك دا و بستخدمها في اعاده جلب البيانات يدويا
    ---- زي في حال الضغط علي زر لجلب البيانات او اي فكره برمجيه تانيه

  ---- props:
  1------ gcTime:
    ----- دي بتمثل مفهوم حفظ البيانات موقتا في مكان تخزين افتراضي والفايده منها انك لما بتجيب البيانات 
    ----- cache time بتعمل علامه تحميل لتحسين من جوده الموقع ومن ثمه بنجيب البيانات ونعرضها في الصفحه وبيتم تلقائي تخزنها في مكان اسمه
    ----- لمده افتراضيه وهي خمس دقائق ومن الممكن التعديل علي المده بتقليلها او زيادتها 
    ----- وطبعا في حاله الخروج من صفحه البيانات والرجوع اليها سوف تظهر بشكل سريع بدون جلب بيانات الي في حاله تحدثها 
    ----- وبعد انتهاء مده التخزين التلقائي يتم حذفها ونبدا في جلب البيانات من جديد

  2------ staleTime: بتقلل عدد الطلبات في السيرفر
    ----  وجدنا انه دائما عند الذهاب والرجوع الي نفس الصفحه يتم عمل ريكوست في السيرفر حته لو البيانات متجددتش 
    ---- في هذه الخاصيه تجعل البيانات التي تم جلبها للتو هي بيانات جديده وفي حاله الذهاب والرجوع لنفس الصفحه 
    ---- مش هيتم عمل ريكوست للسيرفر عشان يجيب البيانات لانه بيعتبر ان البيانات ديه هي اجدد حاجه في متعملش اي طلبات خالص لمده معينه من الزمن
    ---- الخصيه ديه بتقبل قيمه بتعبر عن الزمن بالملي ثانيه والقيمه الافتراضيه لها صفر

  3------ refetchOnMount: [true Default | false | always]
    ---- إذا تم التعيين على "صحيح"، فسيتم إعادة جلب الاستعلام عند التحميل 
    ---- إذا تم التعيين على "خطاء"، فسيتم إعادة جلب الاستعلام في حاله واحده ان الاستعلام يكون موجود لاول مره 
    ---- بمعني لو البيانات متخزنه في الكاش مش هيعمل ليها فيتش تاني لحد ما مدتها تخلص وتتحذف 

  4------ refetchOnWindowFocus: [true Default | false | always]
    ---- إذا تم التعيين على "صحيح"، فسيتم إعادة جلب الاستعلام بشكل مباشر لحظي مش بتحتاج تعمل ريفراش للصفحه يناسب تطبيقات البورصه والاخبار
    ---- إذا تم التعيين على "خطاء"، فسيتم إعادة جلب الاستعلام عند عمل ريفراش للصفحه او التنقل بين الصفحات

  5------ refetchInterval: [false Default | number | function]
    ---- يتم جلب البيانات تلقائيا بشكل دوري كل مده زمنيه معينه انا الي بحددها وبيكون الزمن بالمللي ثانيه
    ---- ملحوظه لو البيانات اتغيرت في الداتا بيز وانا عامل جلب البيانات بشكل دوري كل 10 ثواني مثلا البيانات
    ---- هتفضل قديم قدام المستخدم لحد ما العشر ثواني يخلصوا وبعدها هتجدد تلقائي قدام المستخدم

  =================================== branch documentation-2 ===================================

  6------ enabled: [false]
    ----- تستخدم في ايقاف الاستعلام ومنعه من جلب البيانات بشكل مباشر وبيسمح للمبرمجين جلب البيانات بشكل يدوي
    ----- وتستخدم في جلب البيانات بشكل تتابعي بمعني عندي صفحه بعرض فيها بيانات لمستخدم وعلي اساس البيانات ديه 
    ----- باخد مثلا رقم الايديه منها واستخدامها في استعلام تاني في بوقف الاستعلام التاني دا لحد مجيب البيانات من الاستعلام الاول

  7------ select: 
    ---- query cache تستخدم لتحويل أو اختيار جزء من البيانات التي تم إرجاعها من دالة الاستعلام و هذا لا يؤثر على البيانات المخزنة في
    ---- واهم الاسباب وراء استخدامها انك تقلل البيانات العاده من الاستعلام الي مش محتاجها

  =================================================
  ---- SuperHeroes.jsx لمشاهده الامثله عليها والفهم اكتر اذهب لصفحه
  =================================================

  8------ placeholderData:  
    ---- بتخلني لما بعمل تنقل بين البيانات في صفحات زي اسلوب البجيناشن
    ---- بتخلني اعمله والبيانات القديمه ثابته قدام المستخدم لحد ما تتحدث مش الصفحه كلها بيتعمل ليها تحميل من تاني يعني
    ---- ودا بيحسن من جوده الموقع

  =================================================
  ---- PaginatedQueries.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
*/

/* 
  - useQueries
  ---- بستخدم فيه عمل اكتر من طلب للسيرفر في نفس الوقت بشكل دينامك 
  ---- مثال وليكن عندي جدول فيه كل الابطال وانا عايز اعرض بيانات البطل رقم 1 ورقم 3 و 5 مثلا
  ---- فهنا بعد ما حددت عدد الابطال بقدر ابعت القيم ديه واجيب البيانات بشكل دينامك في نفس الوقت بشكل متوازي
  =================================================
  ---- DynamicParallelQueries.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
  
  - Dependent Queries
  ---- دا اسلوب لجعل الطلبات الخاصه بالسيرفر متتاليه وتعتمد علي نتائج بعض
  ---- يوجد مثال لجلب الكورسات الموجوده في قناه معينه والقناه ديه عشان اوصل ليها لازم اجيب ال ايه ديه بتاعها
  ---- وعشان اجيبه لازم اجيب كل القنوات المرتبطه بي ايميل مستخدم معين
  ---- فالحل اني اعمل فيتش واجيب كل القنوات المرتبط بالاميل دا واخد معرف القناه ديه كنتجه من الفتش الاول
  ---- ومن ثمه احطه كمعطي في الفتش التاني عشان اجيب كل الكورسات الموجوده في القناه ديه 
  =================================================
  ---- DependentQueries.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
*/

/*
  - useQueryClient: 
  ---- دي هوك بتستخدم في جلب كل الطلبات والبيانات الي رجعت من السيرفر وتم تخزينها بشكل موقت في الكاش بتاعنا

  - getQueryData:
  ---- وباستخدام الفانكشن ديه بقدر اجيب طلب معين عن طريق اسم الكي بتاع الكويري بتاعته وبجيب بقا كل البيانات المتخزنه دي 
  ----- بدون ما اعمل الطلب للسيرفر مره اخري طبعا في حاله ان الكاش بتاعنا فاضي من الطلبات هيرجع نيل

  - initialData: 
  ---- دي خاصيه من خواص يوز كويري وبتخلني اعمل فانكشن دورها انها بتجيب البيانات الخاصه بي كيه معين من 
  ---- الكاش في بالتالي هيتم عمل الريكوست عادي للسيرفر بس المستخدم هيظهر ليه بيانات علطول جبتها من الكاش علطول ودي بتحسن من تجربه المستخدم
  ---- لان مش بيكون في اي لودانج قدام المستخدام وبرده بعمل طلب لجلب البيانات من السيرفر بس في الخلفيه
  ---- عشان لو البيانات المتخزنه في الكاش كانت قديمه او نقصه معلومه معينه مثلا

  =================================================
  ---- superHero.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
*/

/*
  - useInfiniteQuery:
    ---- دي هوك بستخدمها عشان استدعي طلبات من السيرفر بشكل لا نهائي وتشبه امر البجيناشن الي شرحته قبل كده وفيها خواص كتيره زي

    - initialPageParam 
    ---- دي البدايه الي بيدا منها الطلب يعتبر اكنه من اول انهي صفحه هيبدا يجيب البيانات

    - getNextPageParam 
    ---- دي خاصيه بتقبل مني فانشكن فيه اتنين بروب وهما لاست بادج وي بادجيس وبتقوم بزياده عدد الصفحات عشان تجبلي البيانات التاليه

    - fetchNextPage
    ---- دي بروبس برده بستخدمها علي شكل فانكشن لاعاده طلب البيانات من السيرفر بشكل متتالي مع تجديد البيانات

    - hasNextPage 
    ---- بروبس بتعرفني في بيانات تاني ولا دي اخر صفحه فيها بيانات بترجع صح او خطا

    - isFetchingNextPage 
    ---- بروبس بتعرفني هل في بيانات دلوقتي بتتجاب من السيرفر ولا لا 

  =================================================
  ---- InfiniteQuery.jsx لمشاهده الامثله عليهم والفهم اكتر اذهب لصفحه
  =================================================
*/